package org.appxi.tome.cbeta;

public enum Period {
    東漢("東漢", 25, 220),
    曹魏("曹魏", 220, 265),
    吳("吳", 229, 280),
    西晉("西晉", 265, 316),
    晉("晉", 265, 420),
    晉世("晉世", 265, 420),
    東晉("東晉", 317, 420),
    前涼("前涼", 301, 387),
    前秦("前秦", 351, 394),
    符秦("符秦", 351, 394),
    後秦("後秦", 384, 417),
    姚秦("姚秦", 384, 417),
    西秦("西秦", 385, 431),
    乞伏秦("乞伏秦", 385, 431),
    北涼("北涼", 397, 460),
    南北朝("南北朝", 439, 589),
    劉宋("劉宋", 420, 479),
    元魏("元魏", 386, 534),
    北魏("北魏", 386, 534),
    後魏("後魏", 386, 534),
    東魏("東魏", 534, 550),
    蕭齊("蕭齊", 479, 502),
    南齊("南齊", 479, 502),
    梁("梁", 502, 557),
    蕭梁("蕭梁", 502, 557),
    北齊("北齊", 550, 577),
    高齊("高齊", 550, 577),
    北周("北周", 557, 581),
    宇文周("宇文周", 557, 581),
    陳("陳", 557, 589),
    隋("隋", 581, 618),
    唐("唐", 618, 907),
    後唐("後唐", 923, 936),
    後晉("後晉", 936, 947),
    石晉("石晉", 936, 947),
    南唐("南唐", 937, 975),
    南漢("南漢", 917, 971),
    後漢("後漢", 947, 951),
    遼("遼", 907, 1125),
    宋("宋", 960, 1279),
    北宋("北宋", 960, 1127),
    南宋("南宋", 1127, 1279),
    唐宋("唐宋", 618, 1279),
    夏("夏", 1032, 1227),
    西夏("西夏", 1032, 1227),
    金("金", 1115, 1234),
    元("元", 1271, 1368),
    明("明", 1368, 1644),
    清("清", 1644, 1911),
    新羅("新羅", -56, 936),
    高麗("高麗", 918, 1392);

    public final String title;
    public final int start, end;

    Period(String title, int start, int end) {
        this.title = title;
        this.start = start;
        this.end = end;
    }

    @Override
    public String toString() {
        return "%s [公元%d～%d年]".formatted(title, start, end);
    }

    public static Period valueBy(String title) {
        for (Period v : values())
            if (v.title.equals(title))
                return v;
        return null;
    }
}
